Documents/ЗаменаСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаменаСерий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Замены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииЗаменаСерий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаПроведена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНовая</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацииЗаменаСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацииЗаменаСерий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаменаСерийОднойНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаНоменклатурыВОднойСерии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаменаСерий/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы      

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);  
	
	ЭтоСтараяСерия = Истина;
	
	// Создаем новый элемент отбора для нашего динамического списка
    ЭлементОтбора = ВыполненныеЗамены.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    // Указываем поле регистра, по которому фильтруем
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Регистратор");
    // Устанавливаем вид сравнения "Равно"
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    // Передаем ссылку на текущий документ. 
    // Если документ новый и еще не записан, ссылка будет пустой, и список логично будет пустым.
    ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
    // Включаем отбор
    ЭлементОтбора.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

	РаботаСоСканеромШК.СканерШКПодключить(); 
	
	УстановитьВидимость();
    УстановитьИнфо();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
    УстановитьИнфо();
	
КонецПроцедуры

#КонецОбласти    


#Область РеквизитыФормы
	
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииЗаменаСерий.ЗаменаНоменклатурыВОднойСерии") Тогда
		ЭтоСтараяСерия = Истина;
	КонецЕсли;
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Режим = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииЗаменаСерий.ЗаменаНоменклатурыВОднойСерии");
	Элементы.ТоварыНоменклатураНовая.Видимость = Режим;
	Элементы.ТоварыСерияНовая.Видимость = НЕ Режим;
	Элементы.ЭтоСтараяСерия.Видимость = НЕ Режим;
	Элементы.ТоварыСерия.Заголовок = ?(Режим, "Серия", "Старая серия");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьИнфо()
	
	Если Объект.ЗаменаПроведена Тогда
		// !
		Если НЕ омСервер.ЕстьРоль("Разработка") Тогда
			ТолькоПросмотр = Истина;    
		КонецЕсли;
		// !
		Элементы.ДекорацияИнфо.Заголовок = НСтр("ru = 'Замена проведена. Документ заблокирован'; en = 'Замена проведена. Документ заблокирован'");
		Элементы.ДекорацияИнфо.ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы.ДекорацияИнфо.Заголовок = НСтр("ru = 'После проведения документ нельзя будет сделать непроведенным, или пометить на удаление'; en = 'После проведения документ нельзя будет сделать непроведенным, или пометить на удаление'");
		Элементы.ДекорацияИнфо.ЦветТекста = WebЦвета.ЗеленыйЛес;
	КонецЕсли;
	
КонецПроцедуры


#Область Скан

//&НаСервере
//Функция ЕстьНаСкладах(Серия)

//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	Рег.Партия КАК Пар,
//	               |	Рег.Партия.Наименование КАК ПарИмя,
//	               |	Рег.ОстатокОстаток КАК Ост,
//	               |	Рег.Номенклатура.Наименование КАК НомИмя
//	               |ИЗ
//	               |	РегистрНакопления.ОстаткиТовара.Остатки(, Партия.Серия = &Серия) КАК Рег
//	               |ГДЕ
//	               |	Рег.ОстатокОстаток > 0";
//	Запрос.УстановитьПараметр("Серия", Серия);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Истина; 
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;

//КонецФункции // ЕстьНаСкладах()

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)

	ЛюбаяСерия(РучнойШК, Истина, Элементы.Товары.ТекущаяСтрока);

КонецПроцедуры  

&НаКлиенте
Процедура ЛюбаяСерия(НовСер, СтатьНаРучной = Ложь, СтрокаФормы = Неопределено)

	ШК = СокрЛП(НовСер);
	Если ШК = "" Тогда Возврат КонецЕсли; 

	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииЗаменаСерий.ЗаменаНоменклатурыВОднойСерии") Тогда
		
		СтрокаТЧ = Объект.Товары.Добавить(); 
		СтрокаТЧ.Партия 		= ПартияПоСерии(ШК);
		СтрокаТЧ.Серия 			= ШК;  
		СтрокаТЧ.Номенклатура 	= гоРеквизит(СтрокаТЧ.Партия, "Владелец");    
		
	ИначеЕсли ЭтоСтараяСерия Тогда   
		
		СписокПартий = омСервер.ПартииПоСерииОстатки(ШК, , ); 
		КвоПартий = СписокПартий.Количество();
	
		Если КвоПартий = 0 Тогда
			Сигнал();
			клОшибка(СтрШаблон("%1: %2 %3", 
								омСервер.Фрмт(НСтр("ru = 'Нет остатков по серии'; en = 'There are no remaining goods for the series!'"), "НАДПИСЬ_ЦВ1"), 
								омСервер.Фрмт(ШК, "НАДПИСЬ_ЦВ2"),
								омСервер.Фрмт("!", "НАДПИСЬ_ЦВ1")));
			Возврат;
		ИначеЕсли КвоПартий > 1 Тогда
			Сигнал();
			Эле = СписокПартий.ВыбратьЭлемент(НСтр("ru = 'Найдено несколько партий с такой серией, выберите:'; en = 'Several batches with this series have been found, please select:'"));
			Если Эле = Неопределено Тогда Возврат КонецЕсли;
			Партия = Эле.Значение;
		Иначе
			Партия = СписокПартий[0].Значение;   
		КонецЕсли; 
		Если ЕстьДубли(ШК) Тогда
			Сообщить(НСтр("ru = 'Серия уже есть в документе!'; en = 'The series is already in the document!'"));
			Возврат;
		КонецЕсли;
		
		СтрокаТЧ = Объект.Товары.Добавить(); 
		СтрокаТЧ.Партия 		= Партия;
		СтрокаТЧ.Серия 			= ШК;  
		СтрокаТЧ.Номенклатура 	= гоРеквизит(Партия, "Владелец");    
		
	Иначе
		
		СтрокаТЧ = Элементы.Товары.ТекущаяСтрока;
		Если СтрокаТЧ = Неопределено Тогда
			Сообщить(НСтр("ru = 'Не выбрана строка табличной части!'; en = 'No table section row selected!'"));		
		//ИначеЕсли КвоПартий > 1 Тогда
		//	Сигнал();
		//	Эле = СписокПартий.ВыбратьЭлемент(НСтр("ru = 'Найдено несколько партий с такой серией, выберите:'; en = 'Several batches with this series have been found, please select:'"));
		//	Если Эле = Неопределено Тогда Возврат КонецЕсли;
		//	Партия = Эле.Значение;
		//Иначе      
		//	Партия = СписокПартий[0].Значение;   
		КонецЕсли;
		//СтрокаТЧ.Партия = Партия;  
		Если ЕстьДубли(ШК) Тогда
			Сообщить(НСтр("ru = 'Серия уже есть в документе!'; en = 'The series is already in the document!'"));
			Возврат;
		КонецЕсли;

		Элементы.Товары.ТекущиеДанные.СерияНовая = ШК;  

	КонецЕсли; 
	
	//Если СтатьНаРучной Тогда 
	//	РучнойШК = "";
	//	ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	//КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура МоеОжидание()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;

КонецПроцедуры

&НаКлиенте
Функция ЕстьДубли(ШК)
	
	Если ЭтоСтараяСерия Тогда
		Имя = "Серия";
	Иначе
		Имя = "СерияНовая";
	КонецЕсли;
	НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура(Имя, ШК));
	Возврат НайдСтроки.Количество() > 0;
	
КонецФункции // ЕстьДубли()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Проведен Тогда 
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			клОшибка(НСтр("ru = 'Документ уже проведен! Вы можете только создать следующий, чтобы записать обратную замену'; en = 'The document is already posted!'"));
		ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			клОшибка(НСтр("ru = 'Документ уже проведен!'; en = 'The document is already posted!'"));
		КонецЕсли;
		Отказ = Истина;
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Вопрос("Вы действительно хотите провести документ? 
					|Отменить действие будет невозможно!", РежимДиалогаВопрос.ДаНет, , , "Будьте бдительны") <> КодВозвратаДиалога.Да Тогда
			Отказ = Истина;	
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненныеЗаменыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ВыполненныеЗаменыОбъектЗамены" Тогда
		СтандартнаяОбработка = Ложь;
        ОткрытьЗначение(Элемент.ТекущиеДанные.ОбъектЗамены);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииЗаменаСерий.ЗаменаНоменклатурыВОднойСерии") Тогда
		СтрокаТЧ = Элементы.Товары.ТекущаяСтрока;
	    СтрокаТЧ.Партия = ПартияПоСерии(СтрокаТЧ.Серия);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПартияПоСерии(Серия)

	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Партии.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Партии КАК Партии
	             |ГДЕ
	             |	Партии.Серия = &Серия
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ
	             |	Партии.Ссылка
	             |ИЗ
	             |	Справочник.Партии КАК Партии
	             |ГДЕ
	             |	Партии.Серия = &Серия";
	Запр.УстановитьПараметр("Серия", Серия);
    Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	    Возврат Выборка.Ссылка;
	Иначе	
	     Возврат Справочники.Партии.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ()

#КонецОбласти
